[
  {
    "id": 1,
    "title": "Top 10 Hidden Beaches to Visit in 2025",
    "image": "https://images.unsplash.com/photo-1507525428034-b723cf961d3e",
    "excerpt": "Discover the most breathtaking, untouched beaches around the world for 2025 — from crystal lagoons to secret tropical coves.",
    "content": "If you’ve grown tired of crowded beaches and noisy resorts, 2025 is your year to explore serenity. Start with Navagio Beach in Greece, famous for its turquoise waters and dramatic cliffs. Head next to the Philippines, where El Nido’s limestone lagoons remain a paradise for divers and explorers. Africa’s Bazaruto Archipelago in Mozambique offers pristine dunes and coral reefs teeming with marine life. Meanwhile, Brazil’s Jericoacoara delivers golden sunsets like nowhere else. To complete your journey, visit the Seychelles’ Anse Source d’Argent — a photographer’s dream with pink-hued sands and granite boulders. These destinations aren’t just beaches; they’re sanctuaries where time seems to stand still."
  },
  {
    "id": 2,
    "title": "How to Travel on a Budget Without Missing Out",
    "image": "https://images.unsplash.com/photo-1502920917128-1aa500764b43",
    "excerpt": "Yes, you can explore the world without breaking the bank. Here’s how seasoned travelers make every dollar count.",
    "content": "Traveling on a budget doesn’t mean sacrificing comfort or experience. The key is planning smartly. Use flight comparison tools like Skyscanner or Google Flights to find the cheapest days to fly. Consider staying in locally owned guesthouses or short-term rentals — they’re not only cheaper but also offer a more authentic experience. Eat where the locals eat; street food is often the best and most affordable. Avoid expensive tours by exploring on foot or using public transport. Lastly, travel off-season: you’ll enjoy lower prices, fewer crowds, and a more relaxed pace. Remember, travel is about the experience, not the expense."
  },
  {
    "id": 3,
    "title": "5 Must-See Destinations in Africa for 2025",
    "image": "https://images.unsplash.com/photo-1568605114967-8130f3a36994",
    "excerpt": "From the golden dunes of Morocco to the vibrant culture of Ghana — Africa is full of unforgettable experiences.",
    "content": "Africa is a continent of contrasts, beauty, and soul. Begin in Morocco, where Marrakech’s bustling souks and the Sahara’s quiet sands show two sides of wonder. Then, head to Kenya for the Maasai Mara — where nature’s drama unfolds in the Great Migration. South Africa’s Cape Town blends beaches, vineyards, and mountains in one dazzling city. For something unique, visit Tanzania’s Zanzibar — an island that combines white beaches with rich Swahili history. Finally, experience Ghana’s cultural warmth in Accra, where heritage, music, and food come together to create pure joy. Africa isn’t just a destination; it’s a feeling you’ll never forget."
  }
]
